app/controllers/artists_controller.rb

SELECT "artists".* FROM "artists"
---
  def index
    if params[:artist_id]
      @artists = Artist.find(params[:artist_id]).songs
    else
      @artists = Artist.all